/******************************************************************** 
修改时间:        2016/03/25 16:46
文件名称:        Passenger.cpp
文件作者:        huming 
=====================================================================
功能说明:         
--------------------------------------------------------------------- 
版本编号:        
--------------------------------------------------------------------- 
其他说明:         
*********************************************************************/

/*********************************************************************
 * INCLUDES
 */
#include "Passenger.h"

/*********************************************************************
 * PUBLIC FUNCTIONS
 */


 /********************************************************************
 *  @name     : CPassenger::initPassenger    
 *  @brief    : 
 *  @param    : id 
 *  @retrun   : void
 ********************************************************************/ 
void CPassenger::initPassenger(uint8 id)
{
  m_iPsgID = id;
  m_iReqCurFlr = 0;
  m_iDestFlr = 0;
  m_fReqTime = 0.0;
  m_fWaitTime = 0.0;
  m_fTravelTime = 0.0;
  m_ePsgState = PSG_WAIT;
}

/********************************************************************
*  @name     : operator<    
*  @brief    : 
*  @param    : rhs 
*  @retrun   : bool
********************************************************************/ 
bool CPassenger::operator <(const CPassenger& rhs) const // 升序排序时必须写的函数
{
  return (m_iDestFlr < rhs.m_iDestFlr);
}

/********************************************************************
*  @name     : operator>    
*  @brief    : 
*  @param    : rhs 
*  @retrun   : bool
********************************************************************/ 
bool CPassenger::operator >(const CPassenger& rhs) const // 降序排序时必须写的函数
{
  return (m_iDestFlr > rhs.m_iDestFlr);
}

/********************************************************************
*  @name     : operator==    
*  @brief    : 
*  @param    : rhs 
*  @retrun   : bool
********************************************************************/ 
bool CPassenger::operator == (const CPassenger& rhs) const
{
  return (m_iPsgID == rhs.m_iPsgID);
}